# 딕셔너리 컴프리헨션

rows = [
    {"주문번호": "A-01", "금액": 1200}, 
    {"주문번호": "A-03", "금액": 900}
]

# 리스트   [ 1, 2, 3, 4]
리스트_결과 = [ r["주문번호"] for r in rows  ]
print(리스트_결과)

# 딕셔너리 -  [ "f" : 1  , "s" :  2 ,  "t" :  3 ]
#           { 키값 :  밸류    for r in rows     if    } 
딕셔너리_결과 = {  r["주문번호"]  :  r["금액"]  for r in rows   }
print(딕셔너리_결과)




rows = [
    {"주문번호": "A-01", "상품": "회복 물약", "금액": 1200},    # 0
    {"주문번호": "A-02", "상품": "강화석", "금액": 900},        # 1
    {"주문번호": "A-03", "상품": "탈것 상자", "금액": 9900},     # 2
]


# {'A-01': '회복 물약', 'A-02': '강화석', 'A-03': '탈것 상자'}
row_dict = {  r["주문번호"] : r["상품"]   for r in rows   }
print(row_dict)


# {'A-01': 1200, 'A-02': 900, 'A-03': 9900}
row_dict = {  r["주문번호"] : r["금액"]   for r in rows   }
print(row_dict)

# {
# 'A-01': {'주문번호': 'A-01', '상품': '회복 물약', '금액': 1200}, 
# 'A-02': {'주문번호': 'A-02', '상품': '강화석', '금액': 900}, 
# 'A-03': {'주문번호': 'A-03', '상품': '탈것 상자', '금액': 9900}
# }
row_dict = {  r["주문번호"] : r  for r in rows   }
print(row_dict)


# {
# 'A-01': {'상품': '회복 물약', '금액': 1200}, 
# 'A-02': {'상품': '강화석', '금액': 900}, 
# 'A-03': {'상품': '탈것 상자', '금액': 9900}
# }
row_dict = {  r["주문번호"] : {  '상품' : r['상품'], '금액' : r['금액']  }  for r in rows   }
print(row_dict)


row_dict = {  r["주문번호"] : r["상품"]   for r in rows  if   r['금액'] >= 1000 }
print(row_dict)



# Q1
rows = [
    {"닉네임": "달빛기사", "레벨": 52},
    {"닉네임": "별빛궁수", "레벨": 48},
    {"닉네임": "서리방패", "레벨": 61},
]

# {'달빛기사': 52, '별빛궁수': 48, '서리방패': 61}
players = { r["닉네임"] : r["레벨"]   for r in rows }
print(players)


# Q2
rows = [
    {"주문번호": "O-101", "결제금액": "12,000"},
    {"주문번호": "O-102", "결제금액": "3,500"},
]

# {'O-101': '12,000', 'O-102': '3,500'}  <-  문자로 우선
# {'O-101': 12000, 'O-102': 3500}  <-  숫자는 시간 되는대로
orders = { r["주문번호"] : int(r["결제금액"].replace(",", ""))  for r in rows }
print(orders)